In [162]:
import pandas as pd
import re

In [163]:
df = pd.read_csv("../data/d01_raw/books_data.csv")

In [164]:
df.head()

,Book_Title,Book_Category,Book_Price,Book_Stock,Book_Rating
0,It's Only the Himalayas,Travel,£45.17,In stock (19 available),Two
1,Full Moon over Noah’s Ark: An Odyssey to Mount...,Travel,£49.43,In stock (15 available),Four
2,See America: A Celebration of Our National Par...,Travel,£48.87,In stock (14 available),Three
3,Vagabonding: An Uncommon Guide to the Art of L...,Travel,£36.94,In stock (8 available),Two
4,Under the Tuscan Sun,Travel,£37.33,In stock (7 available),Three

In [165]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517 entries, 0 to 516
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Book_Title     517 non-null    object
 1   Book_Category  517 non-null    object
 2   Book_Price     517 non-null    object
 3   Book_Stock     517 non-null    object
 4   Book_Rating    517 non-null    object
dtypes: object(5)
memory usage: 20.3+ KB

In [171]:
df.describe()

,Book_Title,Book_Category,Book_Price,Book_Stock,Book_Rating,Book_Stock_Numeros
count,517,517,517,517,517,517
unique,516,50,497,21,5,21
top,The Star-Touched Queen,Childrens,44.18,In stock (16 available),One,16
freq,2,20,3,83,122,83